common/models/Posts.php

SELECT * FROM `wp_posts`
---
    public static function getArticleList(){
        $model=Posts::find()->all();